import React, { useState } from 'react';
import { BrowserRouter as Router, Switch, Route } from 'react-router-dom';

export default function Movie({ movie,  updateMovies }) {

// אובייקט של סרט שמכיל את כל השדות והערכים שלהם בהתאם לסרט שהתקבל, כלומר לסרט שלחצו עליו
   let  m={
        name:  movie.name,
        rate: movie.rate,
        rates: [...movie.rates],
        image: movie.image,
        details: movie.details
    }


//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// סטייט שמכיל את הדירוג שנבחר על ידי המשתמש. הסטייט בתחילה מכיל 0 כדי שיהיה לי קל יותר לבדוק אם באמת נבחר דירוג או לא
   const [uChoise,setUChoise]=useState(0);


// פונקציה שתרוץ כאשר יש אירוע סימון באחד מכפתורי הרדיו שמאפשרים למשתנה לבחור דירוג.
// הפונקציה מקבלת דירוג חדש שבתחילה הוא מחרוזת. משתנה מקומי חדש שיכיל את הדירוג שהתקבלת. לאחר מכן השתמשתי בפונקציה שמקבלת מחרוזת והופכת אותה למספר.
// באופן הבא: הגדרתי משתנה מקומי חדש שיכיל את פונקצייה נאמבר שתכיל את המשתנה המקומי הקודם שמכיל את הדירוג שהתקבל, כלומר. המשתנה החדש
// הוא המשתנה הקודם רק שהערך שלו הוא מסוג מספר.
// לאחר מכן עשיתי עדכון לסטייט של הדירוג שיכיל את הבחירה הנוכחית של המשתמש
   const handleChoise=(newRate)=>{
    let value=newRate.target.value
    let choise= Number(value)
    setUChoise(choise)
   }




//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה שתרוץ כאשר יש אירוע לחיצה על כפתור הדירוג. הפונקציה תבדוק אם הסטייט של הדירוג הוא 0, כלומר, לא נבחר דירוג, אם כן, אז תחזור.
// אם לא, אז מגדירה משתנה מקומי שהוא הערך של סטייט הדירוג הנבחר. מגדיר גם מערך חדש שיכיל את הפיזור של מערך הדירוגים ואז, דוחפת אליו את הדירוג החדש.
// לאחר מכן קוראת לפונקציה שמחשבת את ממוצע הדירוג של הסרט ומעדכנת את אובייקט הסרט בהתאם למה שהתקבל, אלייה שולחים את מערך הדירוגים החדש שיצרנו
// שולחת את אובייקט הסרט המעודכן, אחרי שפונקציית הממוצע עדכנה אותו, לפונקציית עדכון הסרטים שנמצאת ב-אפ על מנת לעדכן את מערך הסרטים ולרנדר אותו מחדש
const handleRate=()=>{
   
    if (uChoise===0){
        return;
    }
    let nr=uChoise
    let ratesArr=[...m.rates];
    ratesArr.push(nr);
avgCal(ratesArr)
updateMovies(m);
}

// פונקציה לחישוב הממוצע אשר מקבלת מערך ורצה כאשר הפונקציה שמטפלת בדירוג קוראת לה.
// מגדיר משתנה מקומי ריק שיכיל את הממוצע של המספרים במערך
// משתנה מקומי חדש שיכיל את אורך המערך שהתקבל. עוד משתנה מקומי שיכיל את סכום כל האיברים שנמצאים במערך.
//reduce- פונקציה למערך שמקבלת סכום נוכחי ואיבר. בתחילה הסכום הוא 0 אבל אחרי האיטרציה הראשונה הסכום הוא האיבר הראשון, באיטרציה השנייה הוא סכום האיבר הראשון ועוד השני וכן הלאה.
//לאחר מכן מציבים בתוך משתנה הממוצע את המשתנה שמכיל את סכום איברי המערך חלקי המשתנה שמכיל את גודל המערך
// ואז מעדכן את השדות של מערך הדירוגים והדירוג הממוצע של אובייקט הסרט בהתאם למה שהתקבל בפונקציה.
const avgCal=(arr)=>{
    
    let avg;
    let l= arr.length;
    let numbers = [...arr];
  let sumOfRates = numbers.reduce((sum, number) => sum + number);
  avg=sumOfRates/l;
  m={   
    name: m.name,
    rate: avg,
    rates: [...arr],
    image: movie.image,
    details: movie.details
  }
  }



//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// מציגה: שם, דירוג , כפתורי רדיו לבחירת דירוג וכפתור לעדכון הדירוג שנבחר
// כפתורי הרדיו הם אינפוט מסוג רדיו. חשוב לתת לכל אחד מהם את אותו השם כדי שאם אחד מהם נלחץ, השני לא יישאר לחוץ
// הערך של כל אחד מהם הוא מספר מסוג מחרוזת. על כל לחיצה על אחד מהם יש קריאה לפונקציה אשר משנה את הסטייט של הבחירה הנוכחית של המשתמש
    return (
        <div className='row justify-content-center '>
            <div>
                <div className='row'>
                    <h5>movie name: {m.name}</h5>
                </div>

                <div className='row'>
                    <h5>rate: {m.rate}</h5>
                </div>

                <div>
                    <h5>rate this movie</h5>

                    <label> 1
            <input type='radio' name='rate' value='1' 
            onChange={handleChoise} />
                    </label>


                    <label> 2
            <input type='radio' name='rate' value='2' 
            onChange={handleChoise}/>
                    </label>


                    <label> 3
            <input type='radio' name='rate' value='3'
            onChange={handleChoise}/>
                    </label>


                    <label> 4
            <input type='radio' name='rate' value='4' 
            onChange={handleChoise}/>
                    </label>


                    <label> 5
            <input type='radio' name='rate' value='5'
            onChange={handleChoise}/>
                    </label>

                </div>
                <div>
                    <button onClick={handleRate}>rate</button>
                </div>

              
            </div>
        </div>
    )
}
